_org_posts/_posts/2021-12-30-boj-1722.org
#+HTML: ---
#+HTML: title: BOJ 1722 순열의 순서
#+HTML: tags: 조합
#+HTML: toc: true
#+HTML: toc_sticky: true
#+HTML: ---
#+OPTIONS: ^:nil

** BOJ 1722 순열의 순서
- K번째 정렬된 순열을 출력하기
- 순열이 주어지면, 몇번째인지 출력하기

** 접근하기
- 정렬된 순열의 성질을 파악하고, fact만큼 이동하는 규칙을 찾기

*** K번째 수열 찾기
#+BEGIN_EXAMPLE
N = 4
K = 3

1 ... 6번 나옴 = 3x2 = 3!      1 ~  6
2 ... 6번 나옴                 7 ~ 12
3 ... 6번 나옴                13 ~ 18
4 ... 6번 나옴                19 ~ 24

K가 3!보다 작다는 것은 맨 앞 숫자가 1이라는 것을 의미
K = 3
ans = {1}

K(3) > 2!
K가 2!보다 크다는 것은 앞서 선택한 1제외, 2제외
K = K - 2! = 1

1 2 3 4 -> 제외
1 2 4 3 -> 제외
1 3 2 4
1 3 4 2
1 4 2 3
1 4 3 2

K(1) == 1!
ans = {1, 3} // 3추가

K(1) == 1
ans = {1, 3, 2}

K(1) == 1
ans = {1, 3, 2, 4}
#+END_EXAMPLE

*** 몇번째 수열인지 출력
#+BEGIN_EXAMPLE
4
2 1 3 2 4

1 x x x = 0
1 3 x x => 1 2 x x = 2!
1 3 2 x => 1!
           
2! + 1! = 3
#+END_EXAMPLE

** 코드
#+BEGIN_SRC cpp
#include <cstdio>

int N;
int cmd;
typedef long long ll;

ll fact[21];

int a[21];
int visit[21];

int main(int argc, char* argv[])
{

    fact[0] = 1;
    for(int i=1;i<=20;i++) {
        fact[i] = fact[i-1] * i;
    }
    scanf("%d", &N);
    scanf("%d", &cmd);

    if (cmd == 1) {
        long long K;
        scanf("%lld", &K);
        for(int i=0;i<N;i++)
        {
            for(int j=1;j<=N;j++) {
                if (visit[j]) continue;

                if (K > fact[N-1-i]) {
                    K -= fact[N-1-i];       // 3 --> 1 --> 0 --> 0
                } else {
                    a[i] = j;
                    visit[j] = 1;
                    break;
                }
            }
        }

        for(int i=0;i<N;i++) {
            printf("%d ", a[i]);
        }
        printf("\n");
    } else {  // cmd 2
        for(int i=0;i<N;i++) {
            scanf("%d", &a[i]);
        }
        
        ll ans = 0;
        for(int i=0;i<N;i++) {
            for(int j=1;j<a[i];j++) {
                if (visit[j]) continue;
                ans += fact[N-i-1];
            }
            visit[a[i]] = 1;
        }
        printf("%lld\n", ans+1);
    }

    return 0;
}


#+END_SRC
** 문제 링크
- https://www.acmicpc.net/problem/1722

** 참고자료
- https://kosaf04pyh.tistory.com/211
